Revit 2024 API
ConduitSizeIterator Class
 An iterator to a set of conduit sizes from ConduitSizes.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class ConduitSizeIterator : IEnumerator<ConduitSize>
Visual Basic
Public Class ConduitSizeIterator _
	Implements IEnumerator(Of ConduitSize)
Visual C++
public ref class ConduitSizeIterator : IEnumerator<ConduitSize^>
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.ConduitSizeIterator
See Also
ConduitSizeIterator Members
Autodesk.Revit.DB.Electrical Namespace